#include<stdio.h>
// 一、算数操作符：+  -  *  /  %
/* int main()
{
    int a = 10 / 3;             // /:返回值是商 3；如果操作符两边是整数，那么执行整数除法，只要有浮点数（小数）就执行浮点数（小数）除法。
    int b = 10 / 3;             // %:返回值是余数 1；这个操作符两边必须为整数，其他几个操作符两边可以为整数或者是浮点数。
    printf("a = %d\n",a);
    printf("b = %d\n",b);
    return 0;
} */

// 二、移位操作符：（移动的是二进制位，并且是整数）（但是不要移动的位数不可以为负数，这种做法是未定义的。）
// 1、>>：右移操作符：对于正整数来说，右移一位就除以2。
// （1）算术右移（通常情况都是这种）：右边丢弃，左边补原符号位（二进制位最高位0表示正数，1表示负数）。
// （2）逻辑右移：右边丢弃，左边补0。
// 如（正整数16）：整数的二进制位表示有：源码、反码、补码（储存到内存中），但正整数三码相同。
/* int main()
{
    int a = 16;                     //16写成二进制：00000000 00000000 00000000 00001000
    int b = a >> 1;                 //向右移动一位： 00000000 00000000 00000000 00001000
    return 0;            //右边丢弃，左边补原符号位：00000000 00000000 00000000 00000100            -->  b值为 8 
} */

// 如（负整数-1）：
/* int main()
{
    int a = -1;                     //-1写成二进制（源码）：10000000 00000000 00000000 00000001   -->   反码（符号位不变，其他位1变0，0变1）：11111111 11111111 11111111 11111110   -->   补码（反码 + 1）：11111111 11111111 11111111 11111111
    int b = a >> 1;                 //向右移动一位：  11111111 11111111 11111111 11111111
    return 0;            //右边丢弃，左边补原符号位： 11111111 11111111 11111111 11111111          -->   发现变化后与之前反码一样，所以这里b的值还是-1。
} */

// 2、<<：左移操作符：对于正整数来说，右移一位就乘以2。
// 只有逻辑左移：左边丢弃，右边补0。
// 如（正整数16）：
/* int main()
{
    int a = 16;                     //16写成二进制： 00000000 00000000 00000000 00001000
    int b = a << 1;                 //向右移动一位：00000000 00000000 00000000 00001000
    return 0;            //右边丢弃，左边补原符号位： 00000000 00000000 00000000 00010000            -->  b值为 32 
} */

// 三、位操作符：&（按位与）、|（按位或）、^（按位异或）   -->   按二进制位。
/* int main()
{
    int a = 1;
    int b = 2;
    int c = a & b;
    // a：00000000 00000000 00000000 00000001
    // b：00000000 00000000 00000000 00000010
    // c：00000000 00000000 00000000 00000000   -->   只有同时为1时才会变为1，其余都是0。   -->   c = 0
    int d = a | b;
    // a：00000000 00000000 00000000 00000001
    // b：00000000 00000000 00000000 00000010
    // d：00000000 00000000 00000000 00000011   -->   只有同时为0时才会变为0，其余都是1。   -->   d = 3
    int e = a ^ b;
    // a：00000000 00000000 00000000 00000001
    // b：00000000 00000000 00000000 00000010
    // e：00000000 00000000 00000000 00000011   -->   相同为0、相异为1。   -->   e = 3
    return 0;
} */

// 例：面试题
// 题目：交换a = 3 和 b = 5两个int变量的值，但是不能使用第三个变量。
// 方法一：加减法（缺点：当数据值很大的时候，会出现溢出的情况）
/* int main()
{
    int a = 3;
    int b = 5;
    a = a + b;   -->   a = 8
    b = a - b;   -->   b = 3
    a = a - b;   -->   a = 5
    return 0;
} */

//方法二：使用异或的方法（缺点：可读性差）
/* int main()
{
    int a = 3;
    int b = 5;
    a = a ^ b;
    // a：00000000 00000000 00000000 00000011   -->   a = 3
    // b：00000000 00000000 00000000 00000101   -->   b = 5
    // a：00000000 00000000 00000000 00000110   -->   a = 6
    b = a ^ b;
    // a：00000000 00000000 00000000 00000110   -->   a = 6
    // b：00000000 00000000 00000000 00000101   -->   b = 5
    // b：00000000 00000000 00000000 00000011   -->   b = 3
    a = a ^ b;   
    // a：00000000 00000000 00000000 00000110   -->   a = 6
    // b：00000000 00000000 00000000 00000011   -->   b = 3
    // a：00000000 00000000 00000000 00000101   -->   a = 5
    return 0;
} */
